app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Sidra"], ["body", "hey"], ["created_at", "2020-05-04 20:59:58.443279"], ["updated_at", "2020-05-04 20:59:58.443279"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "heyyyy"], ["updated_at", "2020-05-04 21:08:51.299952"], ["id", 1]]